//
//  HEFRandomIdiom.m
//  MyProject1
//
//  Created by 成都千锋 on 15/12/5.
//  Copyright (c) 2015年 fazi. All rights reserved.
//

#import "HEFRandomIdiom.h"



@implementation HEFRandomIdiom
/** 生成随机成语*/
+ (NSString *) RandomIdiom{
    NSArray *randomArr = @[@"跃然纸上",@"脸青鼻肿",@"问道于盲",@"取民愈广",@"裙带关系",@"久居人下",@"大张声势",@"归邪转曜",@"双宿双飞",@"随俗雅化",@"万壑争流",@"鸣鼓而攻之",@"纳履决踵",@"眼腰黄赤",@"蹇视高步",@"爱才若渴",@"调风弄月",@"论今说古",@"昂首阔步",@"处安思危",@"曲里拐弯",@"点指画字",@"土鸡瓦犬",@"三毛七孔",@"等闲视之",@"居无求安",@"戴头识脸",@"襟怀坦白",@"融释贯通",@"时运不齐",@"辞简义赅",@"矫矫不羣",@"贼头狗脑",@"君辱臣死",@"泱泱大风",@"亿万斯年",@"一叶障目，不见泰山",@"花枝招展",@"丰功硕德",@"雀小脏全",@"犬马之疾",@"海阔天空",@"树欲静而风不止",@"目无三尺",@"七窍玲珑",@"衣不兼彩",@"室徒四壁",@"孤立寡与",@"食不下咽",@"阐幽抉微",@"逸兴横飞",@"爱才若渴",@"簪缨世胄",@"飘樊落溷",@"寂若无人",@"无根之木，无源之水",@"当立之年",@"裂土分茅",@"灰躯糜骨",@"剖毫析芒",@"大渐弥留",@"造化小儿",@"咄咄怪事",@"众口铄金",@"枝叶扶苏",@"丰功懿德",@"拖金委紫",@"败法乱纪",@"措心积虑",@"抑强扶弱",@"出谋献策",@"离本依末",@"正直无私",@"海阔天空",@"席门蓬巷",@"人情之常",@"发指眦裂",@"鱼大水小",@"与日俱增",@"偃武兴文",@"日东月西",@"饥附饱飏",@"优游自如",@"山峙渊渟",@"遏渐防萌",@"始作俑者",@"熬枯受淡",@"平地风波",@"揽权纳贿",@"郁郁不得志",@"秤不离砣",@"潜踪蹑迹",@"斗酒学士",@"彰往考来",@"牵经引礼",@"日东月西",@"指不胜屈",@"敝衣粝食",@"蓬门筚户",@"背恩负义",@"轮焉奂焉",@"饿殍遍野",@"一扫而光",@"月落星沈",@"迷人眼目",@"以眼还眼",@"打诨插科",@"朱唇皓齿",@"戴圆履方",@"跳梁小丑",@"百年好合",@"金鼓喧阗",@"板上砸钉",@"扫穴擒渠",@"蜂虿有毒",@"梗迹萍踪",@"桑榆晚景",@"俯拾仰取",@"有财有势",@"说好嫌歹",@"波涛汹涌",@"凤泊鸾漂",@"柳陌花丛",@"披林撷秀",@"名垂青史",@"浪蕊浮花",@"雅雀无声",@"吉祥止止",@"愁肠寸断",@"兼容并包",@"雁过留声",@"操翰成章",@"以汤沃沸",@"舍己从人",@"眼迷心荡",@"随珠和璧",@"来去无踪",@"断金零粉",@"轻装上阵",@"入理切情",@"行行出状元",@"偃旗仆鼓",@"金鼓喧阗",@"千兵万马",@"光前絶后",@"从井救人",@"连理之木",@"焦眉皱眼",@"一笑置之",@"重纰貤缪",@"世掌丝纶",@"共商国是",@"张嘴挢舌",@"左拥右抱",@"添油炽薪",@"河水不犯井水",@"雁过留声",@"过颊即空",@"枕席过师",@"积谷防饥",@"以肉去蚁",@"作福作威",@"怨家债主",@"掠人之美",@"眼高手低",@"有国难投",@"习而不察",@"楞头呆脑",@"鲇鱼上竹",@"日昃旰食",@"蠹民梗政",@"迁善远罪",@"佳人才子",@"嬴奸买俏",@"先代所美",@"一模二样",@"取予有节",@"妖由人兴",@"餐霞饮瀣",@"尖言冷语",@"火妻灰子",@"无方之民",@"将取固予",@"乱作胡为",@"富贵不能淫",@"冷嘲热骂",@"诗礼传家",@"鲇鱼上竹",@"手到擒来",@"喜笑颜开",@"大雨如注",@"吉光片羽",@"急急如律令",@"悲歌易水",@"断齑块粥",@"千随百顺",@"昆山片玉",@"驰高鹜远",@"避君三舍",@"朝云暮雨",@"弓影浮杯",@"拽耙扶犁",@"垂首丧气",@"狗胆包天",@"楚棺秦楼",@"夜以继昼",@"富丽堂皇",@"日久天长",@"兵不污刃",@"忐忑不安",@"不露圭角",@"耳濡目及",@"守缺抱残",@"龙飞凤翥",@"高枕安卧",@"弹剑作歌",@"坐卧不安",@"含牙带角",@"杜门绝迹",@"朝不及夕",@"反裘负薪",@"剑态箫心",@"巫山洛浦",@"五雀六燕",@"物至则反",@"骨肉相连",@"枝分缕解",@"达地知根",@"展翅高飞",@"溢美溢恶",@"风流罪过",@"不避斧钺",@"苦海无边，回头是岸",@"气吞宇宙",@"分三别两",@"豺狼横道",@"祝鲠祝噎",@"十有八九",@"坐卧不安",@"偷东摸西",@"绘事后素",@"日月其除",@"此恨绵绵",@"千家万户",@"余霞散绮",@"分毫不爽",@"信笔涂鸦",@"仓卒主人"];
    
    
    NSInteger index = arc4random() % randomArr.count;
    NSString *randomStr = randomArr[index];
    return randomStr;
    
}

/** 返回数字成语*/
+ (NSArray *) returnNumberIdiom{
    
    NSArray *numArray = @[@"一唱一和",@"一呼百应",@"一干二净",@"一举两得",@"一落千丈",@"一模一样",@"一暴十寒",@"一心一意",@"一败涂地",@"一本正经",@"一臂之力",@"一尘不染",@"一见如故",@"一箭双雕",@"一脉相承",@"一目了然",@"一窍不通",@"一视同仁",@"一泻千里",@"一草一木",@"一成不变",@"一帆风顺",@"一鼓作气",@"一哄而散",@"一如既往",@"一丝不苟",@"一言难尽",@"一衣带水",@"一朝一夕",@"一针见血",@"一知半解",@"一表人才",@"一波三折",@"一步登天",@"一筹莫展",@"一触即发",@"一刀两断",@"一技之长",@"一蹶不振",@"一劳永逸",@"一鸣惊人",@"一念之差",@"一贫如洗",@"一气呵成",@"一清二白",@"一扫而空",@"一息尚存",@"一相情愿",@"略胜一筹",@"两败俱伤",@"两虎相斗",@"两面三刀",@"两全其美",@"两小无猜",@"两袖清风",@"进退两难",@"三长两短",@"三顾茅庐",@"三令五申",@"三生有幸",@"三思而行",@"三头六臂",@"三心二意",@"三言两语",@"半夜三更",@"入木三分",@"火冒三丈",@"三天打鱼，两天晒网",@"四海为家",@"四分五裂",@"四面楚歌",@"四通八达",@"四平八稳",@"危机四伏",@"四海升平",@"五彩缤纷",@"五光十色",@"五湖四海",@"五花八门",@"五颜六色",@"五体投地",@"五脏六腑",@"五谷丰登",@"学富五车",@"五雷轰顶",@"六神无主",@"六亲无靠",@"六月飞霜",@"六根清净",@"七零八落",@"七拼八凑",@"七上八下",@"七手八脚",@"七嘴八舌",@" 七窍生烟",@"七情六欲",@"八面玲珑",@"八面威风",@"半斤八两",@"胡说八道",@"八仙过海，各显神通",@"九死一生",@"九牛一毛",@"九霄云外",@"九牛二虎之力",@"含笑九泉",@"十拿九稳",@"十年寒窗",@"十全十美",@"十万火急",@"十指连心",@"十冬腊月",@"神气十足",@"百无禁忌",@"百川归海",@"百读不厌",@"百发百中",@"百废俱兴",@"百感交集",@"百花齐放",@"百口难辩",@"百炼成钢",@"百年不遇",@"百年大计",@"百思不解",@"百战百胜",@"百依百顺",@"百折不挠",@"百孔千疮",@"精神百倍",@"百尺竿头，更进一步",@"百闻不如一见",@"千变万化",@"千差万别",@"千锤百炼",@"千方百计",@"千呼万唤",@"千钧一发",@"千军万马",@"千里迢迢",@"千门万户",@"千难万险",@"千篇一律",@"千秋万代",@"千千万万",@"千山万水",@"千丝万缕",@"千头万绪",@"千辛万苦",@"千言万语",@"千真万确",@"千奇百怪",@"千姿百态",@"千虑一得",@"千虑一失",@"千载难逢",@"千难万险",@"横扫千军",@"万水千山",@"万无一失",@"万众一心",@"万紫千红",@"万死一生",@"万籁俱寂",@"瞬息万变"];

    return numArray;
}

/** 叠字成语*/
+ (NSArray *) returnReiterativeLocutionIdiom{
    NSArray *RLIdiom = @[@"亭亭玉立",@"姗姗来迟",@"栩栩如生",@"欣欣向荣",@"惺惺作态",@"洋洋得意",@"绵绵不绝",@"静静乐道",@"虎视眈眈",@"来势汹汹",@"生机勃勃",@"热气腾腾",@"炯炯有神",@"沾沾自喜",@"头头是道",@"依依惜别",@"节节败退",@"比比皆是",@"飘飘欲仙",@"井井有条",@"愤愤不平",@"小心翼翼",@"死气沉沉",@"大名鼎鼎",@"滔滔不绝",@"步步登高",@"夸夸其谈",@"花花公子",@"娓娓动听",@"历历在目",@"窃窃私语",@"威风凛凛",@"喜气洋洋",@"天网恢恢",@"神采奕奕",@"摇摇欲坠",@"奄奄一息",@"念念不忘",@"跃跃欲试",@"循循善诱",@"人人自危",@"斤斤计较",@"心心相印",@"白发苍苍",@"白雪皑皑",@"气势汹汹",@"人才济济",@"得意洋洋",@"三三两两",@"沸沸扬扬",@"纷纷扬扬",@"郁郁葱葱",@"昏昏沉沉",@"断断续续",@"战战兢兢",@"羞羞答答",@"浩浩荡荡",@"家家户户",@"歪歪扭扭",@"吞吞吐吐",@"轰轰烈烈",@"庸庸碌碌",@"影影绰绰",@"星星点灯"];
    return RLIdiom;
}

/** 含有一对反义词的成语*/
+ (NSArray *) returnOneAntonymsIdiom{
    NSArray *tempArray = @[@"出神入化",@"横七竖八",@"来龙去脉",@"浓妆淡抹",@"逆来顺受",@"朝秦暮楚",@"有恃无恐",@"天经地义",@"转危为安",@"若明若暗",@"弄巧成拙",@"扶老携幼",@"顾此失彼",@"弃暗投明",@"因小失大",@"自始至终",@"七上八下",@"逢凶化吉",@"舍己为人",@"避实击虚",@"大公无私",@"走南闯北",@"取长补短",@"除暴安良",@"顶天立地",@"大材小用",@"古为今用",@"夫唱妇随",@"有气无力",@"殊途同归",@"异曲同工",@"南辕北辙",@"朝令夕改",@"今非昔比",@"同床异梦",@"鬼斧神工",@"异口同声",@"大手大脚",@"从头到尾",@"改邪归正",@"惹是生非",@"弄假成真",@"远亲近邻",@"前仰后合",@"天寒地冻",@"先斩后奏",@"功败垂成",@"若隐若现",@"反败为胜",@"铺天盖地",@"弃旧图新",@"以逸待劳",@"化整为零",@"积少成多",@"拈轻怕重",@"起死回生",@"以攻为守",@"争先恐后",@"横眉立目",@"苦尽甘来",@"东倒西歪",@"官逼民反",@"前赴后继",@"公报私仇",@"水深火热",@"前呼后拥",@"东倒西歪",@"眼高手低",@"口是心非",@"头重脚轻",@"有头无尾",@"前倨后恭",@"东逃西散",@"南辕北辙",@"左顾右盼",@"积少成多",@"同甘共苦",@"半信半疑",@"大材小用",@"先人后己",@"有口无心",@"弄假成真",@"举足轻重",@"南腔北调",@"声东击西",@"转危为安",@"东倒西歪",@"反败为胜",@"以少胜多",@"由此及彼"];
    return tempArray;
}

/** 含有两对反义词的成语*/
+ (NSArray *) returnTwoAntonymsIdiom{
    NSArray *TAIdiom = @[@"神出鬼没",@"人小鬼大",@"南来北往",@"此起彼伏",@"好逸恶劳",@"有名无实",@"喜新厌旧",@"经天纬地",@"你死我活",@"古往今来",@"凶多吉少",@"大同小异",@"寒来暑往",@"生死存亡",@"悲欢离合",@"盛衰荣辱",@"轻重缓急",@"是非曲直",@"厚此薄彼",@"深入浅出",@"先公后私",@"死去活来",@"有始无终",@"藏头露尾",@"前因后果",@"避实就虚",@"送往迎来",@"扶弱抑强",@"先人后己",@"春华秋实",@"天南地北",@"避重就轻",@"外强中干",@"吉凶祸福"];
    return TAIdiom;
}

/** 含有两对近义词的成语*/
+ (NSArray *) returnTwoSynonymsIdrom{
    
    NSArray *tempArray = @[@"深思熟虑",@"真凭实据",@"灵丹妙药",@"凶神恶煞",@"心满意足",@"街头巷议",@"翻山越岭",@"精雕细刻",@"生拉硬扯",@"琼楼玉宇",@"层峦叠嶂",@"心烦意乱",@"崇山峻岭",@"奇形怪状",@"惊涛骇浪",@"装模作样",@"摇头晃脑",@"文丛字顺",@"改朝换代",@"通风报信",@"能说会道",@"甜言蜜语",@"分门别类",@"追根究底",@"虚情假意",@"幸灾乐祸",@"通情达理",@"丰功伟绩",@"歪门邪道",@"生擒活捉",@"离乡背井",@"豪言壮语",@"汪洋大海",@"琼浆玉液",@"斩尽杀绝"];
    return tempArray;
}

/** 动物名称成语*/
+ (NSArray *) returnAnimalIdiom{
    NSArray *tempArray = @[@"鼠目寸光",@"鼠肚鸡肠",@"鼠窃狗盗",@"投鼠忌器",@"抱头鼠窜",@"獐头鼠目",@"胆小如鼠",@"牛鬼蛇神",@"牛刀小试",@"牛鼎烹鸡",@"汗牛充栋",@"对牛弹琴",@"九牛一毛",@"气壮如牛",@"牛毛细雨",@"泥牛入海",@"虎视眈眈",@"虎口余生",@"虎头虎脑",@"虎背熊腰",@"虎头蛇尾",@"虎落平阳",@"虎穴龙潭",@"放虎归山",@"谈虎色变",@"如虎添翼",@"骑虎难下",@"为虎作伥",@"与虎谋皮",@"藏龙卧虎",@"狐假虎威",@"羊入虎口",@"狼吞虎咽",@"龙行虎步",@"龙吟虎啸",@"龙争虎斗",@"龙盘虎踞",@"龙腾虎跃",@"生龙活虎",@"降龙伏虎",@"兔死狐悲",@"兔死狗烹",@"狡兔三窟",@"鸟飞兔走",@"守株待兔",@"龙腾虎跃",@"龙飞凤舞",@"龙马精神",@"龙凤呈祥",@"画龙点睛",@"来龙去脉",@"攀龙附凤",@"群龙无首",@"望子成龙",@"车水马龙",@"人中之龙",@"叶公好龙",@"降龙伏虎",@"老态龙钟",@"笔走龙蛇",@"龙潭虎穴",@"蛇蝎心肠",@"画蛇添足",@"惊蛇入草",@"龙蛇混杂",@"杯弓蛇影",@"牛鬼蛇神",@"打草惊蛇",@"虚与委蛇",@"笔走龙蛇",@"春蚓秋蛇",@"马到成功",@"马不停蹄",@"马革裹尸",@"一马当先",@"老马识途",@"汗马功劳",@"万马齐喑",@"一马平川",@"天马行空",@"快马加鞭",@"走马看花",@"信马由缰",@"蛛丝马迹",@"兵荒马乱",@"万马奔腾",@"犬马之劳",@"单枪匹马",@"招兵买马",@"人仰马翻",@"人困马乏",@"鞍前马后",@"人强马壮",@"猴年马月",@"青梅竹马",@"心猿意马",@"悬崖勒马",@"千军万马",@"香车宝马",@"指鹿为马",@"害群之马",@"厉兵秣马",@"脱僵之马",@"金戈铁马",@"羊质虎皮",@"羊肠小道",@"羊入虎口",@"亡羊补牢",@"虎入羊群",@"顺手牵羊",@"猴年马月",@"沐猴而冠",@"尖嘴猴腮",@"杀鸡吓猴",@"杀鸡儆猴",@"鸡毛蒜皮",@"鸡鸣狗盗",@"鸡飞蛋打",@"鸡犬不宁",@"鸡犬不留",@"鸡犬升天",@"闻鸡起舞",@"杀鸡吓猴",@"杀鸡取卵",@"偷鸡摸狗",@"鹤立鸡群",@"小肚鸡肠",@"鼠肚鸡肠",@"呆若木鸡",@"狗急跳墙",@"狗尾续貂",@"狗仗人势",@"狗血喷头",@"犬马之劳",@"猪狗不如",@"兔死狗烹",@"鼠窃狗盗",@"狼心狗肺",@"狐朋狗友",@"狐群狗党",@"偷鸡摸狗",@"画虎类狗",@"鸡犬不惊",@"鸡零狗碎",@"猪突豨勇",@"猪狗不如",@"杀猪宰羊",@"封豕长蛇",@"凤头猪肚",@"蠢笨如猪",@"鸟尽弓藏",@"笨鸟先飞",@"如鸟兽散",@"小鸟依人",@"惊弓之鸟",@"飞禽走兽",@"凤毛麟角",@"鸦雀无声",@"燕雀安知",@"鹤立鸡群",@"鹤发童颜",@"风声鹤唳",@"莺歌燕舞",@"草长莺飞",@"珍禽异兽",@"衣冠禽兽",@"燕语莺声",@"鹊巢鸠占",@"鹦鹉学舌",@"蜻蜓点水",@"欢呼雀跃",@"鸦雀无声",@"鹏程万里",@"一箭双雕",@"风声鹤唳",@"鹤发鸡皮",@"鹤发童颜",@"鹤立鸡群",@"麻雀虽小，五脏俱全",@"螳螂捕蝉，黄雀在后",@"声誉鹊起",@"饮鸩止渴",@"雁过拔毛",@"鸟枪换炮",@"困兽犹斗",@"如鸟兽散",@"人面兽心",@"飞禽走兽",@"珍禽异兽",@"衣冠禽兽",@"洪水猛兽",@"狼吞虎咽",@"猫鼠同眠",@"黔驴技穷",@"一丘之貉",@"管中窥豹",@"狼心狗肺",@"狼烟四起",@"狼子野心",@"狼狈不堪",@"狼狈为奸",@"豺狼成性",@"豺狼当道",@"引狼入室",@"鹿死谁手",@"中原逐鹿",@"象牙之塔",@"盲人摸象",@"声名狼藉",@"杯盘狼藉",@"豺狼成性",@"狐疑不决",@"黔驴技穷",@"鹏程万里",@"金蚕脱壳",@"蝇头微利",@"花飞蝶舞",@"螳臂挡车",@"鱼跃鸟飞",@"如鱼得水",@"独占鳌头",@"井底之蛙",@"瓮中捉鳖",@"虾兵蟹将",@"鹬蚌相争",@"沉鱼落雁",@"飞蛾扑火",@"金蝉脱壳",@"积蚊成雷",@"蟾宫折挂",@"蚕食鲸吞",@"蜻蜓点水",@"螳臂挡车",@"蛛丝马迹",@"螳螂捕蝉，黄雀在后",@"鱼目混珠",@"蜂拥而至",@"蛊惑人心",@"物腐虫生",@"漏网之鱼",@"海市蜃楼",@"堤溃蚁穴",@"蚕食鲸吞",@"鹤立鸡群",@"鸡鸣狗盗",@"鹬蚌相争",@"蚕食鲸吞",@"蛛丝马迹",@"龙争虎斗",@"龙马精神",@"龙飞凤舞",@"龙腾虎跃",@"龙骧虎步",@"龙潭虎穴",@"龙跃凤鸣",@"车水马龙",@"指鹿为马",@"兔死狐悲",@"鸡犬不宁",@"心猿意马",@"狼吞虎咽"];
    

    return tempArray;
}

/** 植物名称成语*/
+ (NSArray *) returnPlantIdiom{
    NSArray *plantIdiom = @[@"开花结果",@"斩草除根",@"顺藤摸瓜",@"披荆斩棘",@"奇花异果",@"投桃报李",@"粗枝大叶",@"春兰秋菊",@"火树银花",@"叶落归根",@"节外生枝",@"李代桃僵",@"树大根深",@"瓜熟蒂落",@"根深蒂固",@"柳暗花明",@"桃红柳绿",@"瓜田李下",@"风扫落叶",@"布帛蔬栗",@"出水芙蓉",@"一枕黄粱",@"视入草芥",@"雨后春笋",@"昙花一现",@"明日黄花",@"横生枝节",@"草菅人命",@"草木皆兵",@"桑榆暮景",@"黄粱美梦",@"荆棘丛生",@"花枝招展",@"豆蔻年华",@"天女散花",@"如火如荼",@"名列前茅",@"锦上添花",@"囫囵吞枣",@"火中取栗",@"目光如豆",@"沧海一粟",@"胸有成竹",@"春暖花开",@"三顾茅庐",@"世外桃源",@"鸟语花香",@"风吹草动",@"鸡毛蒜皮",@"繁花似锦",@"借花献佛",@"滚瓜烂熟",@"枯木逢春",@"望梅止渴",@"拔苗助长",@"五谷不分",@"花容月貌",@"叶落知秋",@"树大招风",@"藕断丝连",@"萍水相逢",@"草长莺飞",@"花团锦簇"];
    return plantIdiom;
}

/** 人体名称成语*/
+ (NSArray *) returnHumanBodyIdiom{
    NSArray *bodyIdiom = @[@"面无人色",@"心旷神怡",@"耳熟能详",@"心花怒放",@"蒙头转向",@"满面春风",@"屈指可数",@"满目疮痍",@"铁面无私",@"令人发指",@"出人头地",@"魂不附体",@"食不果腹",@"不绝于耳",@"爱不释手",@"面黄肌瘦",@"口干舌燥",@"劈头盖脸",@"提心吊胆",@"评头论足",@"肺腑之言",@"心口如一",@"身外之物",@"足不出户",@"手无寸铁",@"心事重重",@"满腔热忱",@"促膝谈心",@"信手拈来",@"灭顶之灾",@"另眼相看",@"腥风血雨",@"喜笑颜开",@"大打出手",@"失之交臂",@"汗流浃背",@"光彩夺目",@"心惊肉跳",@"面红耳赤",@"拳打脚踢",@"鹤发童颜",@"赏心悦目",@"抓耳挠腮",@"浓眉大眼",@"血肉相连",@"毛骨悚然",@"手足无措",@"掩人耳目",@"铁石心肠",@"病入膏肓",@"沁人肺腑",@"血流成河",@"口若悬河",@"面不改色",@"眉飞色舞",@"两手空空",@"信口开河",@"垂头丧气",@"满腹牢骚",@"燃眉之急",@"挖空心思",@"绞尽脑汁",@"义愤填膺",@"引人注目",@"泰山压顶",@"皮开肉绽",@"心灵手巧",@"举手投足",@"点头哈腰",@"肥头大耳",@"心腹之患",@"心心相印",@"唇齿相依",@"骨肉相连",@"至亲骨肉",@"徒费唇舌",@"痛入骨髓",@"趾高气扬",@"筋疲力尽",@"目不暇接",@"破口大骂",@"闭目塞听",@"扬眉吐气",@"怒发冲冠",@"切齿痛恨",@"掩耳盗铃",@"病从口入",@"扣人心弦",@"浪子回头",@"成竹在胸",@"不堪回首",@"眼明手快",@"胆战心惊",@"摩拳擦掌",@"慈眉善目",@"没头没脑",@"肝肠寸断",@"耳目众多",@"肝胆相照",@"恨入骨髓",@"感人肺腑",@"了如指掌",@"眼花缭乱",@"骨瘦如柴",@"脚踏实地",@"夺眶而出",@"惊心动魄",@"俯首听命",@"接踵而来",@"挺身而出",@"唾手可得",@"咬紧牙关",@"为国捐躯",@"良药苦口",@"掉以轻心",@"恨之入骨",@"耳聪目明",@"唇亡齿寒",@"头重脚轻",@"粉身碎骨",@"蓬头垢面",@"五脏六腑",@"咬牙切齿",@"血口喷人",@"腹背受敌",@"肝脑涂地",@"沁人心脾",@"近在眉睫",@"情同手足",@"眼高手低",@"目瞪口呆",@"胸无点墨",@"头重脚轻",@"手足情深",@"口是心非",@"眼疾手快",@"耳闻目睹",@"头破血流",@"眉清目秀",@"袖手傍观",@"口出不逊",@"七嘴八舌",@"交头接耳",@"手无缚鸡之力"];
    return bodyIdiom;
}

/** 方位名称成语*/
+ (NSArray *) returnLocationIdiom{
    NSArray *LocationIdiom = @[@"旁若无人",@"前车之鉴",@"旁敲侧击",@"人间地狱",@"节外生枝",@"福如东海",@"马放南山",@"居高临下",@"蒙在鼓里",@"前呼后拥",@"外柔中刚",@"前仰后合",@"上蹿下跳",@"东张西望",@"走南闯北",@"字里行间",@"左右开弓",@"转战南北",@"后起之秀",@"内顾之忧",@"掌上明珠",@"雨后春笋",@"梁上君子",@"泰山北斗",@"袖手旁观",@"大敌当前",@"锥处囊中",@"左邻右舍",@"上漏下湿",@"左顾右盼",@"里勾外连",@"天上人间",@"秀外慧中",@"天南地北",@"内外交困",@"举国上下",@"东窗事发",@"下不为例",@"苦中作乐",@"绵里藏针",@"稳操左卷",@"名列前茅",@"力争上游",@"后来居上",@"臵之脑后",@"南征北战",@"里应外合",@"外强中干",@"南来北往",@"安内攘外",@"说东道西",@"瞻前顾后",@"左右为难",@"中流砥柱",@"间不容发",@"天下大乱",@"江东父老",@"日薄西山",@"以绝后患",@"九霄云外",@"游戏人间",@"喜出望外",@"外圆内方",@"东鳞西爪",@"内忧外患",@"惩前毖后",@"彻里彻外",@"声东击西",@"俯仰之间"];
    return LocationIdiom;
}

/** 描写四季的成语*/
+ (NSArray *) returnFourSeasonsIdiom{
    NSArray *tempArray = @[@"阳春三月",@"春光明媚",@"春回大地",@"春暖花开",@"春意盎然",@"春意正浓",@"风和日丽",@"春花烂漫",@"鸟语花香",@"百鸟鸣春",@"百花齐放",@"莺歌燕舞",@"万紫千红",@"春雨如油",@"生机勃勃",@"春色满圆",@"春意盎然",@"和风细雨",@"赤日炎炎",@"烈日炎炎",@"骄阳似火",@"挥汗如雨",@"大汗淋漓",@"鸟语蝉鸣",@"万木葱茏",@"枝繁叶茂",@"莲叶满池",@"秋高气爽",@"天高云淡",@"秋风送爽",@"秋菊怒放",@"秋菊傲骨",@"秋色迷人",@"秋色宜人",@"金桂飘香",@"果实累累",@"北雁南飞",@"满山红叶",@"五谷丰登",@"芦花飘扬",@"天寒地冻",@"北风呼啸",@"滴水成冰",@"寒冬腊月",@"瑞雪纷飞",@"冰天雪地",@"冰封雪盖",@"漫天飞雪",@"白雪皑皑",@"冰封大地"];

    return tempArray;
}

/** 隔字相同的成语*/
+ (NSArray *) returnSameWordsIdiom{
    NSArray *tempArray = @[@"古色古香",@"天兵天将",@"不死不活",@"稳扎稳打",@"任劳任怨",@"有始有终",@"无穷无尽",@"大模大样",@"自高自大",@"破罐破摔",@"大喊大叫",@"自作自受",@"偏听偏信",@"本乡本土",@"有声有色",@"群策群力",@"虎头虎脑",@"无依无靠",@"毛手毛脚",@"人山人海",@"载歌载舞",@"瓮声瓮气",@"如泣如诉",@"问长问短",@"若隐若现",@"不慌不忙",@"难解难分",@"久而久之",@"如醉如痴",@"活灵活现",@"无影无踪",@"无拘无束",@"同心同德",@"无声无息",@"无边无际"];
    return tempArray;
}

/** 其他的成语*/
+ (NSArray *) returnOtherIdiom{
    
    
    
    NSArray *tempArray = @[@"花红柳绿",@"花色迷人",@"花香醉人",@"花枝招展",@"百花齐放",@"百花盛开",@"百花争艳",@"绚丽多彩",@"五彩缤纷",@"万紫千红",@"春暖花开",@"鸟语花香",@"姹紫嫣红",@"花红柳绿",@"百花争艳",@"锦上添花",@"火树银花",@"昨日黄花",@"春花秋月",@"过时黄花",@"花团锦簇",@"花枝招展",@"绿草如茵",@"一碧千里",@"杂草丛生",@"生机勃勃",@"绿油油",@"苍翠挺拔",@"郁郁葱葱",@"枯木逢春",@"秀丽多姿",@"青翠欲滴",@"林海雪原",@"耸入云天",@"寸草不生",@"山清水秀",@"青山绿水",@"高耸入云",@"崇山峻岭",@"山明水秀",@"山穷水尽",@"大好山河",@"刀山火海",@"地动山摇",@"高山深涧",@"悬崖峭壁",@"峰峦雄伟",@"漫山遍野",@"江山如画",@"锦绣山河",@"荒山野地",@"水平如镜",@"高山流水",@"千山万水",@"水滴石穿",@"水乳交融",@"滴水不漏",@"杯水车薪",@"洪水猛兽",@"流水无情",@"清香鲜嫩",@"青翠欲滴",@"果园飘香",@"果实累累",@"果实饱满",@"鲜嫩水灵",@"大雪纷飞",@"大雪封山",@"鹅毛大雪",@"漫天飞雪",@"瑞雪纷飞",@"风雪交加",@"电光石火",@"雷电大作",@"惊天动地",@"春雷滚滚",@"电劈石击",@"雷电交加",@"阴雨连绵",@"牛毛细雨",@"秋雨连绵",@"随风飘洒",@"倾盆大雨",@"狂风暴雨",@"大雨淋漓",@"暴雨如注",@"大雨滂沱",@"瓢泼大雨",@"大雨倾盆",@"血雨腥风",@"风雨交加",@"风调雨顺",@"枪林弹雨",@"风雨同舟",@"风雨无阻",@"和风细雨",@"狂风暴雨",@"满城风雨",@"春风化雨",@"风雨飘摇",@"斜风细雨",@"未雨绸缪",@"秋风送爽",@"金风送爽",@"北风呼啸",@"微风习习",@"寒风刺骨",@"风和日丽",@"彩云满天",@"天高云淡",@"乌云翻滚",@"彤云密布",@"九霄云外",@"腾云驾雾",@"壮志凌云",@"风云变幻",@"风起云涌",@"行云流水",@"风卷残云",@"浮云蔽日",@"孤云野鹤",@"烘云托月",@"过眼云烟",@"烟消云散",@"旭日东升",@"日上三竿",@"一轮红日",@"日高三尺",@"艳阳高照",@"烈日当头",@"骄阳似火",@"日影西斜",@"碧空万里",@"浩浩长空",@"晴空万里",@"万里无云",@"碧空如洗"];
    return tempArray;
}

@end
